app/controllers/comments_controller.rb

	def new
		@post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "63"]]

	def create
		@post = Post.find(params[:post_id])

		@post.comments.create(params[:comment].permit(:body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "63"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Cracking post!"], ["created_at", Tue, 19 Nov 2013 11:09:14 UTC +00:00], ["post_id", 63], ["updated_at", Tue, 19 Nov 2013 11:09:14 UTC +00:00]]