app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "title") VALUES ($1, $2) RETURNING "id"  [["body", "Cloudy, yo!"], ["title", "Weather"]]
---
	def create
		@post = Post.create(params[:post].permit(:title, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "91"]]
---
	def edit
		@post = Post.find params[:id]

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "135"]]
UPDATE "posts" SET "body" = $1 WHERE "posts"."id" = 140  [["body", "And also..."]]
---
	def update
		@post = Post.find params[:id]
		puts "params[:id]: #{params[:id]}"
		@post.update(params[:post].permit(:title, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "334"]]
---
	def delete
		@post = Post.find(params[:id])