app/controllers/votes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "32"]]
INSERT INTO "votes" ("created_at", "direction", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 21 Nov 2013 08:38:16 UTC +00:00], ["direction", "up"], ["post_id", 40], ["updated_at", Thu, 21 Nov 2013 08:38:16 UTC +00:00]]
---
	def create
		#authenticate_user!
		# raise params.inspect
 		@post = Post.find params[:post_id]
 	  @post.votes.create(direction: params[:direction])